artillery/test.yaml
# config:
#   target: 'http://localhost:3000'
#   phases:
#     - duration: 60
#       arrivalRate: 10
# scenarios:
#   - flow:
#       - get:
#           url: "/products"


# config:
#   target: 'http://localhost:3000'
#   phases:
#     - duration: 60
#       arrivalRate: 100
# scenarios:
#   - flow:
#       - get:
#           url: "/products/{{$randomNumber(1, 900000)}}"


# config:
#   target: 'http://localhost:3000'
#   phases:
#     - duration: 60
#       arrivalRate: 100
# scenarios:
#   - flow:
#       - get:
#           url: "/products/{{$randomNumber(1, 900000)}}/styles"


config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 500
scenarios:
  - flow:
      - get:
          url: "/products/{{$randomNumber(1, 900000)}}/related"